{
    "name": "Terms of Service",
    "version": "1",
    "change_log": "Initial version",
    "content": "<div style=\"padding: 20px; font-family: Arial, sans-serif;\"><h1>RL Bets – Terms of Service</h1><p><strong>Last Updated:</strong> 01/19/2025</p><p>Welcome to RL Bets (the “Service”), operated by Carver Endeavors LLC (“Company,” “we,” “us,” or “our”), with a principal address at 916 N Mill St Apt H, Festus, MO 63028. These Terms of Service (“Terms”) govern your use of RL Bets, including any associated websites, mobile applications, or online services (collectively, the “Platform”). By accessing or using the Platform, you (“User,” “you,” or “your”) agree to be bound by these Terms. If you do not agree, please do not use the Platform.</p><h2>1. Acceptance & Modification of Terms</h2><h3>1.1 Binding Agreement</h3><p>By creating an account, accessing, or using the Platform, you acknowledge that you have read, understood, and agree to be bound by these Terms as well as our Privacy Policy, which is incorporated herein by reference.</p><h3>1.2 Right to Modify</h3><p>We reserve the right to update or modify these Terms at any time. If we make material changes, we will notify you by email or by posting a prominent notice on the Platform. Your continued use of the Platform after such changes become effective constitutes acceptance of the updated Terms.</p><h2>2. User Eligibility & Age Verification</h2><h3>2.1 Minimum Legal Betting Age</h3><p>Users must meet the minimum legal betting age in their jurisdiction, which may be 18 or 21 depending on state or local laws. By registering for an account, you represent and warrant that you meet this minimum age requirement.</p><h3>2.2 Verification via Third-Party Services</h3><p>You agree to provide accurate personal information (e.g., name, date of birth, address, Social Security number) for identity verification. We may use third-party services, such as Plaid, to confirm your age, identity, and other details. You authorize us to verify your information through these services which includes document verification.</p><h2>3. Geolocation & State-by-State Restrictions</h2><h3>3.1 Permitted Jurisdictions</h3><p>RL Bets is currently only available to Users physically located in U.S. states where online sports betting is legal. You agree not to access or place bets from any location outside these permitted jurisdictions.</p><h3>3.2 Geolocation Checks</h3><p>We use geolocation technologies—including Nominatim for reverse geocoding—to determine your approximate location. If we are unable to verify that you are within a permitted state, or if you appear to be located in a restricted area, you will be prevented from placing bets.</p><h3>3.3 Compliance with Local Laws</h3><p>You are responsible for ensuring that your use of the Platform complies with all applicable state and federal laws. We make no representations that the Service is available or appropriate in every jurisdiction.</p><h2>4. Fictional Credits & Earned Credits</h2><h3>4.1 Credits (Purchased)</h3><ul><li>RL Bets uses a fictional currency called “Credits.”</li><li>Credits are purchased through Stripe using a valid credit or debit card.</li><li>Credits do not expire once purchased.</li><li>Credits cannot be refunded (unless required by law) or transferred between Users.</li></ul><h3>4.2 Earned Credits</h3><p>“Earned Credits” are the amount of Credits won from successful wagers. Earned Credits are accumulated separately from the purchased Credits in your account and reflect your winnings.</p><h3>4.3 No Transfers or Refunds</h3><p>Credits are non-transferable between Users and non-redeemable for cash, except as part of a valid real-money payout described in these Terms.</p><h2>5. Betting Mechanics & Winnings</h2><h3>5.1 Placing Bets</h3><p>Users can view and participate in “Wagers” (e.g., “Team A will win this match”) by choosing Agree or Disagree and staking a chosen number of Credits.</p><p>There is no imposed maximum or minimum bet limit at this time, although we reserve the right to implement one if needed for regulatory or responsible-gaming reasons.</p><h3>5.2 Odds & Payout Formulas</h3><p>Payouts are determined by weighted formulas that factor in the total number of Credits staked on each side of the wager.</p><pre>If You Bet on “Agree”: Potential Winnings = Bet + (D × Bet) / (Bet + D)</pre><pre>If You Bet on “Disagree”: Potential Winnings = Bet + (A × Bet) / (Bet + A)</pre><h3>5.3 Real-Money Payouts</h3><p>Depending on the rules of a specific leaderboard period or promotion, Users may be eligible to receive real-money payouts if they top the leaderboards or meet specific criteria.</p><h2>6. Leaderboards & Tie-Breakers</h2><p>The Platform may feature leaderboards that rank Users by their total Earned Credits over specific timeframes.</p><h2>7. Dispute Resolution & Arbitration Clause</h2><p>If you have a dispute, please contact us at <a href=\"mailto:[email protected]\">[email protected]</a>.</p><h2>8. Contact Information</h2><p><strong>Carver Endeavors LLC</strong></p><p>916 N Mill St Apt H</p><p>Festus, MO 63028</p></div>"
}